Amiya200/stm32_water_tank/Core/Src/lora.c
/* ── Non-blocking poll of DIO0 ──────────────────────────────────────── */
static uint8_t LoRa_PollPacket(uint8_t *buffer, int16_t *rssi_out)
{
    if (HAL_GPIO_ReadPin(LORA_DIO0_PORT, LORA_DIO0_PIN) == GPIO_PIN_RESET)
        return 0;

    uint8_t irq = LoRa_ReadReg(REG_IRQ_FLAGS);
    LoRa_WriteReg(REG_IRQ_FLAGS, 0xFF);

    if (irq & 0x20u) return 0;            /* CRC error  */
    if ((irq & 0x40u) == 0u) return 0;    /* not RxDone */

    uint8_t len = LoRa_ReadReg(REG_RX_NB_BYTES);
    if (len == 0u || len >= (LORA_BUF_SIZE - 1u)) return 0;

    uint8_t fifoAddr = LoRa_ReadReg(REG_FIFO_RX_CURRENT);
    LoRa_WriteReg(REG_FIFO_ADDR_PTR, fifoAddr);
    LoRa_ReadBuffer(REG_FIFO, buffer, len);
    buffer[len] = '\0';

    if (rssi_out != NULL)
        *rssi_out = (int16_t)(-157 + (int16_t)LoRa_ReadReg(REG_PKT_RSSI_VALUE));

    return len;
}

/* ── Critical-path TX — send reply, then immediately back to RX ────── *
 * NO HAL_Delay here.  Every ms costs the ACK window.
 * ──────────────────────────────────────────────────────────────────── */
static void LoRa_FastReply(const char *pkt, uint8_t len)
{
    if (pkt == NULL || len == 0u || len >= LORA_BUF_SIZE) return;

    /* Mirror to debug buffer for Live Expressions                      */
    if (len < MAX_PACKET_LEN)
    {
        memcpy((void *)g_lastTxPacket, pkt, len);
        g_lastTxPacket[len] = '\0';
    }

    LoRa_WriteReg(REG_OPMODE,        0x81);  /* LoRa standby            */
    /* FifoTxBaseAddr is already 0 (set in init) — modulator will read
     * from FIFO[0..len-1] which is exactly where we write below.       */
    LoRa_WriteReg(REG_FIFO_ADDR_PTR, 0x00);
    LoRa_WriteBuffer(REG_FIFO, (const uint8_t *)pkt, len);
    LoRa_WriteReg(0x22, len);                /* RegPayloadLength        */
    LoRa_WriteReg(REG_IRQ_FLAGS,     0xFF);
    LoRa_WriteReg(REG_OPMODE,        0x83);  /* LoRa TX                 */

    uint32_t t0 = HAL_GetTick();
    while ((LoRa_ReadReg(REG_IRQ_FLAGS) & 0x08u) == 0u)
    {
        if ((HAL_GetTick() - t0) > LORA_TX_TIMEOUT_MS) break;
    }
    LoRa_WriteReg(REG_IRQ_FLAGS, 0x08u);

    LoRa_EnterRxContinuous();
}

/* ── Reply builders → wire ──────────────────────────────────────────── */
static void send_ack(uint32_t did)
{
    char buf[24];
    int n = LoRa_BuildAck(buf, sizeof(buf), did);
    if (n > 0) LoRa_FastReply(buf, (uint8_t)n);
}

static void send_pong(uint32_t did, uint32_t seq)
{
    char buf[32];
    int n = LoRa_BuildPong(buf, sizeof(buf), did, seq);
    if (n > 0) LoRa_FastReply(buf, (uint8_t)n);
}

static void send_reject(uint32_t did)
{
    char buf[24];
    int n = LoRa_BuildReject(buf, sizeof(buf), did);
    if (n > 0) LoRa_FastReply(buf, (uint8_t)n);
}

static void send_sync_req(void)
{
    char buf[24];
    int n = LoRa_BuildSyncReq(buf, sizeof(buf), DeviceID_GetOwn());
    if (n > 0) LoRa_FastReply(buf, (uint8_t)n);
}

/* ── State helpers ──────────────────────────────────────────────────── */
const char *LoRa_GetStateString(void)
{
    switch (s_state)
    {
        case LORA_STATE_DISCONNECTED: return "WAITING";
        case LORA_STATE_HANDSHAKING : return "HANDSHAKING";
        case LORA_STATE_CONNECTED   : return "CONNECTED";
        case LORA_STATE_STALE       : return "STALE";
        default                     : return "?";
    }
}

LoRa_ConnState_t LoRa_GetState(void) { return s_state; }

static void set_state(LoRa_ConnState_t ns)
{
    if (s_state == ns) return;
    s_state = ns;
    g_loraConnected = (ns == LORA_STATE_CONNECTED) ? 1u : 0u;
    log_defer("[LORA RX] STATE -> %s", LoRa_GetStateString());
}

/* ── Pairing logic (auto-pair when list empty) ─────────────────────── */
static bool already_in_list(uint32_t did)
{
    uint8_t cnt = PairedDev_Count();
    for (uint8_t i = 0; i < cnt; i++)
        if (PairedDev_Get(i) == did) return true;
    return false;
}

static bool should_allow(uint32_t did)
{
    if (!LoRa_DID_IsValid(did))      return false;
    if (s_pairingMode)               return true;
    return PairedDev_IsAllowed(did);  /* covers in-list + open-mode */
}

static void pair_device(uint32_t did)
{
    if (!LoRa_DID_IsValid(did)) return;
    s_lastPairedDID = did;

    if (already_in_list(did)) return;     /* already known, nothing to do */

    if (PairedDev_Add(did))
    {
        s_pairingDone   = true;
        s_pairingMode   = false;
        s_seqInitialized = false;
        s_lastSeq        = 0;
        log_defer("[LORA RX] *** PAIRED DID %08lX  (%u in list) ***",
                  (unsigned long)did, (unsigned)PairedDev_Count());
    }
    else
    {
        log_defer("[LORA RX] PairedDev_Add failed (list full?)");
    }
}

/* ── Pairing API ────────────────────────────────────────────────────── */
void LoRa_EnterPairingMode(void)
{
    s_pairingMode     = true;
    s_pairingDone     = false;
    s_lastPairedDID   = 0;
    s_pairingDeadline = HAL_GetTick() + RX_PAIRING_TIMEOUT_MS;
    uart_print_now("[LORA RX] *** MANUAL PAIRING MODE (30 s) ***");
    LED_SetIntent(LED_COLOR_BLUE, LED_MODE_BLINK, 200);
}

void     LoRa_ExitPairingMode  (void) { s_pairingMode = false; }
bool     LoRa_IsPairingMode    (void) { return s_pairingMode;  }
bool     LoRa_IsPairingComplete(void) { return s_pairingDone;  }
uint32_t LoRa_GetLastPairedDID (void) { return s_lastPairedDID;}

/* ── Wireless data accessors ────────────────────────────────────────── */
uint8_t  LoRa_GetWirelessTankLevel(void) { return s_wirelessLevel;   }
uint8_t  LoRa_GetWirelessWellDry  (void) { return s_wirelessWellDry; }
uint32_t LoRa_GetLastSequence     (void) { return s_lastSeq;         }
uint32_t LoRa_GetPacketsLost      (void) { return s_packetsLost;     }

bool LoRa_IsWirelessDataValid(void)
{
    if (!s_wirelessDataValid) return false;

    if ((HAL_GetTick() - s_wirelessLastRxTick) > RX_PEER_TIMEOUT_MS)
    {
        s_wirelessDataValid = false;
        s_wirelessWellDry   = 0;
        if (s_state == LORA_STATE_CONNECTED)
        {
            set_state(LORA_STATE_STALE);
            uart_print_now("[LORA RX] !!! peer timeout — STALE");
            LED_SetIntent(LED_COLOR_RED, LED_MODE_BLINK, 500);
            s_seqInitialized = false;
        }
        return false;
    }
    return true;
}

/* ── Sequence validation ────────────────────────────────────────────── */
static bool validate_sequence(uint32_t newSeq)
{
    if (!s_seqInitialized)
    {
        s_lastSeq        = newSeq;
        s_seqInitialized = true;
        return true;
    }

