Amiya200/stm32_water_tank/Core/Src/lora.c
    if (newSeq == s_lastSeq)
    {
        s_duplicatePackets++;
        log_defer("[LORA RX] dup seq %08lX", (unsigned long)newSeq);
        return false;
    }

    if (newSeq < s_lastSeq)
    {
        if ((s_lastSeq - newSeq) > 0x10000UL)
        {
            log_defer("[LORA RX] seq jumped back — TX restarted, resync");
            s_lastSeq        = newSeq;
            s_seqInitialized = true;
            return true;
        }
        s_outOfOrderPackets++;
        return false;
    }

    if (newSeq > s_lastSeq + 1u)
    {
        uint32_t lost = newSeq - (s_lastSeq + 1u);
        s_packetsLost += lost;
        log_defer("[LORA RX] gap: lost %lu pkt(s)", (unsigned long)lost);
    }

    s_lastSeq = newSeq;
    return true;
}

/* ── Accept fresh data into model ───────────────────────────────────── */
static void accept_data(uint8_t lvl, uint8_t wd, uint32_t did)
{
    s_wirelessLevel      = lvl;
    s_wirelessWellDry    = wd;
    s_wirelessLastRxTick = HAL_GetTick();
    s_wirelessDataValid  = true;
    s_lastPeerTick       = HAL_GetTick();
    g_loraNewPacketFlag  = true;
    (void)did;

    if (s_state != LORA_STATE_CONNECTED)
        set_state(LORA_STATE_CONNECTED);
}

/* ====================================================================
 *  L o R a _ I n i t   —   includes ALL the radio-config fixes
 * ==================================================================== */
void LoRa_Init(void)
{
    char dbg[120];

    uart_print_now("");
    uart_print_now("=========================================");
    uart_print_now("  HELONIX RX  —  LoRa long-range init");
    uart_print_now("=========================================");

    DeviceID_Init();
    PairedDev_Init();

    char myDIDstr[9];
    DeviceID_GetHex(myDIDstr);
    snprintf(dbg, sizeof(dbg), "[LORA RX] My DID : %s", myDIDstr);
    uart_print_now(dbg);

    snprintf(dbg, sizeof(dbg), "[LORA RX] Paired : %u device(s) in EEPROM",
             (unsigned)PairedDev_Count());
    uart_print_now(dbg);

    if (PairedDev_Count() == 0u)
    {
        uart_print_now("[LORA RX] List empty — AUTO-PAIR first valid HELLO");
    }
    else
    {
        for (uint8_t i = 0; i < PairedDev_Count(); i++)
        {
            snprintf(dbg, sizeof(dbg), "[LORA RX]   [%u] DID %08lX",
                     i, (unsigned long)PairedDev_Get(i));
            uart_print_now(dbg);
        }
    }

    /* ── HW reset & SPI link diagnostic ─────────────────────────────── */
    NSS_HIGH();          /* deselect chip first                          */
    LoRa_Reset();

    /* Read RegVersion (0x42) — should be 0x12 for SX1276/77/78/79.
     * If you see 0x00 or 0xFF the SPI link is broken: wrong NSS pin,
     * bad solder, module unpowered, or wrong SPI mode.  Stop here and
     * fix that BEFORE touching anything else.                        */
    uint8_t ver = LoRa_ReadReg(REG_VERSION);
    snprintf(dbg, sizeof(dbg),
             "[LORA RX] RegVersion(0x42)=0x%02X  (expected 0x12)", ver);
    uart_print_now(dbg);
    if (ver != 0x12)
    {
        uart_print_now("[LORA RX] *** SPI LINK BROKEN — radio cannot be reached ***");
        uart_print_now("[LORA RX] Check: NSS pin, RESET pin, SPI MOSI/MISO/SCK,");
        uart_print_now("[LORA RX]        module power (3.3 V) and ground.");
    }

    /* ── Mode transition: FSK Standby → FSK Sleep → LoRa Sleep ──────── *
     * LongRangeMode bit can ONLY be changed while in Sleep mode, so
     * we must enter FSK sleep first.  After power-on the chip is in
     * FSK Standby (0x01), not Sleep — the previous code skipped the
     * FSK-Sleep step which works on most chips but not all.           */
    LoRa_WriteReg(REG_OPMODE, 0x00);   /* FSK  Sleep   */
    HAL_Delay(2);
    LoRa_WriteReg(REG_OPMODE, 0x80);   /* LoRa Sleep   */
    HAL_Delay(10);

    /* ── 433 MHz frequency ──────────────────────────────────────────── */
    uint64_t frf = ((uint64_t)433000000ULL << 19) / 32000000ULL;
    LoRa_WriteReg(0x06, (uint8_t)(frf >> 16));
    LoRa_WriteReg(0x07, (uint8_t)(frf >>  8));
    LoRa_WriteReg(0x08, (uint8_t)(frf));

    /* ── Preamble length (12 symbols) ───────────────────────────────── */
    LoRa_WriteReg(0x20, LORA_PREAMBLE_MSB);
    LoRa_WriteReg(0x21, LORA_PREAMBLE_LSB);

    /* ── PA: +20 dBm via PA_BOOST (so ACKs reach the TX node) ───────── */
    LoRa_WriteReg(0x09, LORA_REG_PA_CONFIG);
    LoRa_WriteReg(0x0B, LORA_REG_OCP);
    LoRa_WriteReg(0x4D, LORA_REG_PA_DAC);

    /* ── Modem config ─────────────────────────────────────────────── */
    LoRa_WriteReg(0x1D, LORA_REG_MODEM_CFG1);   /* BW125, CR4/5, explicit hdr */
    LoRa_WriteReg(0x1E, LORA_REG_MODEM_CFG2);   /* SF10, CRC ON               */
    LoRa_WriteReg(0x26, LORA_REG_DETECT_OPT);   /* LowDataRateOpt + AGC auto  */
    LoRa_WriteReg(0x39, LORA_SYNC_WORD);        /* 0x12 — private network      */

    /* ─── THE FIX ──────────────────────────────────────────────────── *
     *
     *   Without these two writes the SX1276 modulator transmits from
     *   FIFO[0x80..] (default value of FifoTxBaseAddr) instead of
     *   FIFO[0..] where we actually write the payload bytes.  Result:
     *   valid LoRa frames go on air but every byte is junk.
     *
     *   Setting both base addresses to 0 lets us use the full 256-byte
     *   FIFO for whichever direction is active (we are half-duplex).
     * ──────────────────────────────────────────────────────────────── */
    LoRa_WriteReg(REG_FIFO_TX_BASE_ADDR, 0x00);
    LoRa_WriteReg(REG_FIFO_RX_BASE_ADDR, 0x00);

    /* ── Verify the writes actually took effect (catches silent SPI fails) */
    uint8_t v_tx = LoRa_ReadReg(REG_FIFO_TX_BASE_ADDR);
    uint8_t v_rx = LoRa_ReadReg(REG_FIFO_RX_BASE_ADDR);
    uint8_t v_op = LoRa_ReadReg(REG_OPMODE);
    snprintf(dbg, sizeof(dbg),
             "[LORA RX] Verify: OpMode=0x%02X TxBase=0x%02X RxBase=0x%02X",
             v_op, v_tx, v_rx);
    uart_print_now(dbg);

    /* ── Enter RX continuous ───────────────────────────────────────── */
    LoRa_EnterRxContinuous();
    HAL_Delay(5);
    uint8_t v_op2 = LoRa_ReadReg(REG_OPMODE);
    snprintf(dbg, sizeof(dbg),
             "[LORA RX] OpMode after EnterRxContinuous: 0x%02X (want 0x85)",
             v_op2);
    uart_print_now(dbg);

    /* ── Reset connection state ────────────────────────────────────── */
    s_state              = LORA_STATE_DISCONNECTED;
    g_loraConnected      = 0;
    s_seqInitialized     = false;
    s_lastSeq            = 0;
    s_packetsLost        = 0;
    s_duplicatePackets   = 0;
    s_outOfOrderPackets  = 0;
    s_wirelessDataValid  = false;
    s_wirelessLevel      = 0;
    s_wirelessWellDry    = 0;
    s_pairingMode        = false;

    uart_print_now("[LORA RX] Init complete — listening for transmitter...");
    LED_SetIntent(LED_COLOR_PURPLE, LED_MODE_STEADY, 1);
}

/* ── Periodic STALE handling ────────────────────────────────────────── */
static void handle_stale_periodics(uint32_t now)
{
    if (s_state != LORA_STATE_STALE) return;

    if ((now - s_lastSyncReqTick) >= RX_SYNC_REQ_INTERVAL_MS)
    {
        s_lastSyncReqTick = now;
        send_sync_req();
        uart_print_now("[LORA RX] STALE — sent @SY (waiting for TX HELLO)");
    }
}

/* ── Per-cycle stats (every 30 s) ───────────────────────────────────── */
static void maybe_print_stats(uint32_t now)
{
    if ((now - s_lastStatsTick) < 30000UL) return;
    s_lastStatsTick = now;

