Amiya200/stm32_water_tank/Core/Src/lora.c
    char dbg[160];
    snprintf(dbg, sizeof(dbg),
             "[LORA RX] stats rx=%lu lost=%lu dup=%lu lvl=%u%% wd=%u "
             "state=%s paired=%u",
             (unsigned long)s_rxPacketCount,
             (unsigned long)s_packetsLost,
             (unsigned long)s_duplicatePackets,
             (unsigned)s_wirelessLevel,
             (unsigned)s_wirelessWellDry,
             LoRa_GetStateString(),
             (unsigned)PairedDev_Count());
    uart_print_now(dbg);
}

/* ====================================================================
 * LoRa_Task  —  call every main-loop iteration (RX main.c → ~10 ms)
 * ==================================================================== */
void LoRa_Task(void)
{
    if (loraMode != LORA_MODE_RECEIVER) return;

    uint32_t now = HAL_GetTick();

    if (s_wirelessDataValid)
        (void)LoRa_IsWirelessDataValid();

    if (s_pairingMode && (now >= s_pairingDeadline))
    {
        s_pairingMode = false;
        uart_print_now("[LORA RX] pairing window expired");
    }

    handle_stale_periodics(now);
    maybe_print_stats(now);

    /* Try to read a packet                                              */
    int16_t rssi = 0;
    uint8_t len  = LoRa_PollPacket(s_rxBuf, &rssi);

    if (len == 0)
    {
        log_flush();
        return;
    }

    s_rxBuf[len] = '\0';
    s_rxPacketCount++;

    if (len < MAX_PACKET_LEN)
        memcpy((void *)g_lastRxPacket, s_rxBuf, (size_t)(len + 1u));

    ParsedPacket_t p;
    bool ok = LoRa_ParsePacket((const char *)s_rxBuf, &p);

    log_defer("[LORA RX] rx#%lu rssi=%d state=%s \"%s\"",
              (unsigned long)s_rxPacketCount, (int)rssi,
              LoRa_GetStateString(), (char *)s_rxBuf);

    if (!ok)
    {
        log_defer("[LORA RX] parse failed — ignored");
        log_flush();
        return;
    }

    switch (p.type)
    {
        case PKT_TYPE_HELLO:
            if (should_allow(p.did))
            {
                pair_device(p.did);
                send_ack(p.did);

                s_lastPeerTick      = now;
                s_wirelessDataValid = false;
                s_seqInitialized    = false;
                if (s_state != LORA_STATE_CONNECTED)
                    set_state(LORA_STATE_CONNECTED);

                log_defer("[LORA RX] HELLO from %08lX -> ACK, CONNECTED",
                          (unsigned long)p.did);
                LED_SetIntent(LED_COLOR_GREEN, LED_MODE_BLINK, 300);
            }
            else
            {
                send_reject(p.did);
                log_defer("[LORA RX] HELLO from unknown %08lX -> REJECT",
                          (unsigned long)p.did);
            }
            break;

        case PKT_TYPE_TANKLEVEL:
            if (!should_allow(p.did))
            {
                send_reject(p.did);
                log_defer("[LORA RX] TL from unpaired -> REJECT");
                break;
            }
            pair_device(p.did);
            {
                bool fresh = validate_sequence(p.seq);
                send_ack(p.did);

                if (fresh)
                {
                    accept_data(p.level, p.well_dry, p.did);
                    LED_SetIntent(LED_COLOR_GREEN, LED_MODE_STEADY, 1);
                    log_defer("[LORA RX] TL=%u%% WD=%u seq=%08lX -> ACCEPTED",
                              (unsigned)p.level, (unsigned)p.well_dry,
                              (unsigned long)p.seq);
                }
                else
                {
                    s_lastPeerTick = now;
                    log_defer("[LORA RX] TL dup -> re-ACKed");
                }
            }
            break;

        case PKT_TYPE_PING:
            if (!should_allow(p.did)) { send_reject(p.did); break; }
            send_pong(p.did, p.seq);
            s_lastPeerTick = now;
            if (s_state != LORA_STATE_CONNECTED)
                set_state(LORA_STATE_CONNECTED);
            log_defer("[LORA RX] PING -> PONG seq=%08lX",
                      (unsigned long)p.seq);
            break;

        case PKT_TYPE_BYE:
            log_defer("[LORA RX] BYE from %08lX -> STALE",
                      (unsigned long)p.did);
            s_wirelessDataValid = false;
            set_state(LORA_STATE_STALE);
            LED_SetIntent(LED_COLOR_RED, LED_MODE_BLINK, 500);
            break;

        default:
            log_defer("[LORA RX] unexpected pkt type %d", (int)p.type);
            break;
    }

    log_flush();
}
